app/Controllers/BookFairUpload.php

SELECT COUNT(*) AS `numrows`
FROM `book_fair_item_wise_sale`
WHERE `isbn` = '9789356957466'
AND `book_fair_name` = 'Pondy-Dec2025'
---
            }

            // DUPLICATE CHECK
            $exists = $db->table('book_fair_item_wise_sale')
                ->where([
                    'isbn' => $isbn,
                    'book_fair_name' => $bookfairName
                ])
                ->countAllResults();

SELECT `quantity`
FROM `paperback_stock`
WHERE `book_id` = '2003'
---
                    WHERE book_id = ?
                ", [$quantity, $bookId]);

                $stockInHand = $db->table('paperback_stock')
                    ->select('quantity')
                    ->where('book_id', $bookId)
                    ->get()
                    ->getRow('quantity') ?? 0;