app/Models/ComboBookfairModel.php

    public function getReturnOrder($orderId)
    {
        $data['order'] = $this->db->table('bookfair_sale_or_return_orders o')
            ->select('o.*,bs.bookshop_name,cp.pack_name')
            ->join('pod_bookshop bs','bs.bookshop_id=o.bookshop_id','left')
            ->join('bookfair_combo_pack cp','cp.combo_id=o.combo_id','left')
            ->where('o.order_id',$orderId)
            ->get()
            ->getRowArray();

        $data['books'] = $this->db->table('bookfair_sale_or_return_order_details d')
            ->select('d.*,b.book_title,a.author_name')
            ->join('book_tbl b','b.book_id=d.book_id','left')
            ->join('author_tbl a','a.author_id=b.author_name','left')
            ->where('d.order_id',$orderId)
            ->get()
            ->getResultArray();
---
SELECT `o`.*, `bs`.`bookshop_name`, `cp`.`pack_name`
FROM `bookfair_sale_or_return_orders` `o`
LEFT JOIN `pod_bookshop` `bs` ON `bs`.`bookshop_id`=`o`.`bookshop_id`
LEFT JOIN `bookfair_combo_pack` `cp` ON `cp`.`combo_id`=`o`.`combo_id`
WHERE `o`.`order_id` = '1770720200'
SELECT `d`.*, `b`.`book_title`, `a`.`author_name`
FROM `bookfair_sale_or_return_order_details` `d`
LEFT JOIN `book_tbl` `b` ON `b`.`book_id`=`d`.`book_id`
LEFT JOIN `author_tbl` `a` ON `a`.`author_id`=`b`.`author_name`
WHERE `d`.`order_id` = '1770720200'

    public function getBookfairOrderDetails($orderId)
    {
        $details = $this->db->table('bookfair_sale_or_return_orders o')
            ->join('pod_bookshop s','s.bookshop_id=o.bookshop_id','left')
            ->join('bookfair_combo_pack c','c.combo_id=o.combo_id','left')
            ->where('o.order_id',$orderId)
            ->get()
            ->getRowArray();

       $list = $this->db->table('bookfair_sale_or_return_order_details d')
        ->select('d.*, b.book_title, a.author_name, l.language_name')
        ->join('book_tbl b','b.book_id=d.book_id','left')
        ->join('author_tbl a','a.author_id=b.author_name','left')
        ->join('language_tbl l','l.language_id=b.language','left')
        ->where('d.order_id',$orderId)
        ->get()
        ->getResultArray();
---
SELECT *
FROM `bookfair_sale_or_return_orders` `o`
LEFT JOIN `pod_bookshop` `s` ON `s`.`bookshop_id`=`o`.`bookshop_id`
LEFT JOIN `bookfair_combo_pack` `c` ON `c`.`combo_id`=`o`.`combo_id`
WHERE `o`.`order_id` = '1770720200'
SELECT `d`.*, `b`.`book_title`, `a`.`author_name`, `l`.`language_name`
FROM `bookfair_sale_or_return_order_details` `d`
LEFT JOIN `book_tbl` `b` ON `b`.`book_id`=`d`.`book_id`
LEFT JOIN `author_tbl` `a` ON `a`.`author_id`=`b`.`author_name`
LEFT JOIN `language_tbl` `l` ON `l`.`language_id`=`b`.`language`
WHERE `d`.`order_id` = '1770720200'

    public function getBookfairComboBooks($comboId)
    {
        return $this->db->table('bookfair_combo_pack_details d')
            ->select('
                c.pack_name,
                b.book_id,
                b.book_title,
                b.paper_back_inr,
                a.author_name,
                l.language_name,
                IFNULL(p.stock_in_hand,0) as stock,
                d.default_value
            ')
            ->join('bookfair_combo_pack c','c.combo_id=d.combo_id','left')
            ->join('book_tbl b','b.book_id=d.book_id','left')
            ->join('author_tbl a','a.author_id=b.author_name','left')
            ->join('language_tbl l','l.language_id=b.language','left')
            ->join('paperback_stock p','p.book_id=b.book_id','left')
            ->where('d.combo_id', $comboId)
            ->get()
            ->getResultArray();
---
SELECT `c`.`pack_name`, `b`.`book_id`, `b`.`book_title`, `b`.`paper_back_inr`, `a`.`author_name`, `l`.`language_name`, IFNULL(p.stock_in_hand, 0) as stock, `d`.`default_value`
FROM `bookfair_combo_pack_details` `d`
LEFT JOIN `bookfair_combo_pack` `c` ON `c`.`combo_id`=`d`.`combo_id`
LEFT JOIN `book_tbl` `b` ON `b`.`book_id`=`d`.`book_id`
LEFT JOIN `author_tbl` `a` ON `a`.`author_id`=`b`.`author_name`
LEFT JOIN `language_tbl` `l` ON `l`.`language_id`=`b`.`language`
LEFT JOIN `paperback_stock` `p` ON `p`.`book_id`=`b`.`book_id`
WHERE `d`.`combo_id` = '1'

    public function getComboOrders($comboId)
    {
        return $this->db->table('bookfair_sale_or_return_orders o')
            ->select('
                o.order_id,
                o.combo_id,
                o.book_fair_name,
                o.sending_date,
                o.total_qty,
                o.status,

                bs.bookshop_name,
                c.pack_name AS combo_name
            ')
            ->join('pod_bookshop bs', 'bs.bookshop_id = o.bookshop_id', 'left')
            ->join('bookfair_combo_pack c', 'c.combo_id = o.combo_id', 'left')
            ->where('o.combo_id', $comboId)
            ->orderBy('o.order_id', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `o`.`order_id`, `o`.`combo_id`, `o`.`book_fair_name`, `o`.`sending_date`, `o`.`total_qty`, `o`.`status`, `bs`.`bookshop_name`, `c`.`pack_name` AS `combo_name`
FROM `bookfair_sale_or_return_orders` `o`
LEFT JOIN `pod_bookshop` `bs` ON `bs`.`bookshop_id` = `o`.`bookshop_id`
LEFT JOIN `bookfair_combo_pack` `c` ON `c`.`combo_id` = `o`.`combo_id`
WHERE `o`.`combo_id` = '1'
ORDER BY `o`.`order_id` DESC