app/Models/PaperbackModel.php

    public function getDashboardData()
    {
        // Step 1: Get paperback book status counts
        $builder = $this->db->table('book_tbl');
        $builder->select('paper_back_readiness_flag, paper_back_flag, COUNT(*) AS cnt');
        $builder->where('paper_back_flag', 1);
        $builder->groupBy('paper_back_readiness_flag');

        $result1 = $builder->get()->getResultArray();
---
SELECT `paper_back_readiness_flag`, `paper_back_flag`, COUNT(*) AS cnt
FROM `book_tbl`
WHERE `paper_back_flag` = 1
GROUP BY `paper_back_readiness_flag`