app/Models/ProspectiveManagementModel.php

SELECT `pp`.`plan_name`, `pp`.`cost` AS `plan_unit_cost`, COUNT(DISTINCT b.title) AS total_titles, COALESCE(SUM(b.payment_amount), 0) AS total_paid
FROM `publishing_plan_details` `pp`
LEFT JOIN `prospectors_book_details` `b` ON `b`.`plan_name` = `pp`.`plan_name`
LEFT JOIN `prospectors_details` `pd` ON `pd`.`id` = `b`.`prospector_id`
WHERE `pd`.`prospectors_status` = 1
GROUP BY `pp`.`plan_name`, `pp`.`cost`
---
public function getPlanSummaryHome()
{
    $db = \Config\Database::connect();

    // Fixed 7 plan names
    $allPlans = [
        'Silver',
        'Gold',
        'Platinum',
        'Rhodium',
        'Silver++',
        'Pearl',
        'Sapphire'
    ];

    // Fetch summary
    $query = $db->table('publishing_plan_details pp')
        ->select('pp.plan_name, pp.cost AS plan_unit_cost,
                  COUNT(DISTINCT b.title) AS total_titles,
                  COALESCE(SUM(b.payment_amount), 0) AS total_paid')
        ->join('prospectors_book_details b', 'b.plan_name = pp.plan_name', 'left')
        ->join('prospectors_details pd', 'pd.id = b.prospector_id', 'left')
        ->where('pd.prospectors_status', 1)
        ->groupBy('pp.plan_name, pp.cost')
        ->get()
        ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `prospectors_book_details` `b`
LEFT JOIN `prospectors_details` `pd` ON `pd`.`id` = `b`.`prospector_id`
WHERE `b`.`plan_name` = 'Silver'
AND `pd`.`prospectors_status` = 1
AND DATE(b.create_date) = '2026-01-01'
---
        ];

        // Today
        $row['today_count'] = $db->table('prospectors_book_details b')
            ->join('prospectors_details pd', 'pd.id = b.prospector_id', 'left')
            ->where('b.plan_name', $planName)
            ->where('pd.prospectors_status', 1)
            ->where('DATE(b.create_date)', date('Y-m-d'))
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `prospectors_book_details` `b`
LEFT JOIN `prospectors_details` `pd` ON `pd`.`id` = `b`.`prospector_id`
WHERE `b`.`plan_name` = 'Silver'
AND `pd`.`prospectors_status` = 1
AND MONTH(b.create_date) = '01'
AND YEAR(b.create_date) = '2026'
---
            ->countAllResults();

        // Previous Month
        $row['prev_month_count'] = $db->table('prospectors_book_details b')
            ->join('prospectors_details pd', 'pd.id = b.prospector_id', 'left')
            ->where('b.plan_name', $planName)
            ->where('pd.prospectors_status', 1)
            ->where('MONTH(b.create_date)', date('m', strtotime('-1 month')))
            ->where('YEAR(b.create_date)', date('Y', strtotime('-1 month')))
            ->countAllResults();